/* OK Button Name */
"OKButtonName" = "OK";

/* Cancel Button Name */
"CancelButtonName" = "Cancel";

/* Opening filename message */
"OpeningFileX" = "Opening %@…";

/* Default name for a new untitled model. */
"UntitledModel" = "untitled model";

/* Name of styles pane in preferences panel (currently used for Syntax coloring) */
"PreferencesTabStyles" = "Syntax Coloring";

/* Name of LDraw pane in preferences panel */
"PreferencesTabLDraw" = "LDraw";


/*-****************************************************************************/
/*-  Toolbar Strings                                                          */
/*-****************************************************************************/

/* Label for button to move selection along the x-axis */
"NudgeX" = "Move X";

/* Label for button to move selection along the y-axis */
"NudgeY" = "Move Y";

/* Label for button to move selection along the z-axis */
"NudgeZ" = "Move Z";

/* Label for control to change the grid granularity */
"GridSpacing" = "Grid Spacing";

/* Label for button to align parts to the grid */
"SnapToGrid" = "Snap to Grid";

/* Rotation buttons. Key should match toolbar item identifier */
"Rotate+X" = "Rotate +X";
"Rotate-X" = "Rotate -X";
"Rotate+Y" = "Rotate +Y";
"Rotate-Y" = "Rotate -Y";
"Rotate+Z" = "Rotate +Z";
"Rotate-Z" = "Rotate -Z";

/* Zoom In/Out buttons; magnify the object being viewed */
"ZoomIn" = "Zoom In";
"ZoomOut" = "Zoom Out";
"ZoomScale" = "Scale";


/*-****************************************************************************/
/*-  Dimensions panel strings                                                 */
/*-****************************************************************************/

/* Units of Measument */
"Studs" = "Studs";
"Inches" = "Inches";
"Centimeters" = "Centimeters";
"LegonianFeet" = "Legonian Imperial Feet";

/* Feet-and-Inches shorthand: Prime for feet, Double-prime for inches. Also acceptable: "%d ft. %d in." */
"FeetAndInchesFormat" = "%d′-%d″";


/*-****************************************************************************/
/*-  Step exporting strings                                                   */
/*-****************************************************************************/

/* Default name for exported steps folder */
"ExportedStepsFolderFormat" = "%@ Steps";

/* Filename format for exported steps. */
"ExportedStepsFileFormat" = "%@, Step %d.ldr";


/*-****************************************************************************/
/*-  LDraw folder-chooser dialog strings                                      */
/*-****************************************************************************/

/* Title for dialog */
"Choose LDraw Folder" = "Choose LDraw Folder";

/* Default button for dialog */
"Choose" = "Choose";

/* Explanatory message for folder chooser dialog */
"LDrawFolderChooserMessage" = "This is the path to the folder containing the LDraw part definitions.";

/* Error message text for bogus folder */
"LDrawFolderChooserErrorMessage" = "The LDraw folder you selected is not complete.";

/* Error informative text for bogus folder */
"LDrawFolderChooserErrorInformative" = "You must download the LDraw parts library from www.ldraw.org. Please do not expect this program to do anything without it.\n\nOnce you have a valid LDraw folder, select it in Bricksmith's preferences.";



/*-****************************************************************************/
/*- Part Browser strings                                                      */
/*-		the categories themselves are read directly from the LDraw files, so  */
/*-		they are not localizable.                                             */
/*-****************************************************************************/

/* All categories element */
"All Categories" = "All Categories";

/* Category name for primitive files found in the LDraw/p directory (such as stud.dat) */
"Primitives" = "Primitives";

/* Category name for subpart files found in the LDraw/parts/s directory */
"Subparts" = "Subparts";

/* No recent searches -- menu title for search cell */
"NoRecentSearches" = "No recent searches";



/*-****************************************************************************/
/*- File Contents Outline strings                                             */
/*-		Stuff used to display components of the file contents outline drawer  */
/*-****************************************************************************/

/* Display the name of an unknown metacommand (like "0 L3P IFNOTPOV"); probably for someone else's program */
"UnknownMetaCommand" = "Unknown Metacommand";

/* Display the name of a line */
"Line" = "Line";

/* Display the name of a triangle */
"Triangle" = "Triangle";

/* Display the name of a quadrilateral */
"Quadrilateral" = "Quadrilateral";

/* Display the name of a conditional line */
"ConditionalLine" = "Conditional Line";

/* Display the name of a step */
"Step" = "Step";

/* Display the name of a step showing step number */
"StepDisplayWithNumber" = "Step %d";



/*-****************************************************************************/
/*- Inspector strings                                                         */
/*-****************************************************************************/

/* Nothing selected to inspect */
"EmptySelection" = "Empty Selection";

/* Nothing selected to inspect */
"MultipleSelection" = "Multiple Selection";

/* Nothing inspectable is selected (no inspector available) */
"NoInspector" = "Nothing to Inspect";



/*-****************************************************************************/
/*- Error Messages                                                            */
/*-		Stuff you toss into annoying dialogs                                  */
/*-****************************************************************************/

/* Can't delete an LDraw line: Bold Dialog Message */
"DeleteDirectiveError" = "%@ cannot be deleted.";

/* Can't delete last model; small informative dialog text */
"DeleteLastModelInformative" = "You must have at least one model in every file.";

/* Can't delete last step; small informative dialog text */
"DeleteLastStepInformative" = "You must have at least one step in every model.";

/* MissingPiecesMessage */
"MissingPiecesMessage" = "Bricksmith couldn't find all of the pieces in this file.";

/* MissingPiecesInformative - a list will be appended to this string*/
"MissingPiecesInformative" = "The following are missing:";


/* MovedPiecesMessage */
"MovedPiecesMessage" = "Some of the parts in this model have been assigned new reference numbers. Do you want to update them?";

/* MovedPiecesInformative - a list will be appended to this string*/
"MovedPiecesInformative" = "LDraw.org occasionally renumbers part files when more accurate information becomes available, such as Lego's internal part number.\n\nShould you choose not to update, this model will still display correctly. However, some parts will have names such as \"~Moved to 1234.\"";



/*-****************************************************************************/
/*- Undo action names                                                         */
/*-		The Undo manager automatically sets the name of the Undo menu to      */
/*-		incorporate these names, i.e., "Undo Color".                          */
/*-****************************************************************************/

/* Added a new submodel */
"UndoAddModel" = "Add Model";

/* Added a new step */
"UndoAddStep" = "Add Step";

/* Added a new part */
"UndoAddPart" = "Add Part";

/* Added a new Line */
"UndoAddLine" = "Add Line";

/* Added a new Triangle */
"UndoAddTriangle" = "Add Triangle";

/* Added a new Quadrilateral */
"UndoAddQuadrilateral" = "Add Quadrilateral";

/* Added a new ConditionalLine */
"UndoAddConditionalLine" = "Add Conditional Line";

/* Added a new Comment */
"UndoAddComment" = "Add Comment";

/* Line attributes change */
"UndoAttributesLine" = "Line Attributes";

/* Triangle attributes change */
"UndoAttributesTriangle" = "Triangle Attributes";

/* Quadrilateral attributes change */
"UndoAttributesQuadrilateral" = "Quadrilateral Attributes";

/* Conditional Line attributes change */
"UndoAttributesConditionalLine" = "Conditional Line Attributes";

/* Model attributes change */
"UndoAttributesModel" = "Model Attributes";

/* Part attributes change */
"UndoAttributesPart" = "Part Attributes";

/* Color change */
"UndoColor" = "Color";

/* Duplicated the selection */
"UndoDuplicate" = "Duplicate";

/* Hid the part */
"UndoHidePart" = "Hide Part";

/* Movement */
"UndoMove" = "Move";

/* Moved directives within a file */
"UndoReorder" = "Reorder";

/* Rotated a part within a file */
"UndoRotate" = "Rotate";

/* Revealed a hidden part */
"UndoShowPart" = "Show Part";

/* Snap to Grid -- made a part to align along the grid lines */
"UndoSnapToGrid" = "Snap to Grid";

/*-****************************************************************************/
/*- Color Names                                                               */
/*-                                                                           */
/*-		The format "LDraw: %d" must be followed when adding new color names.  */
/*-		(However, color definitions are defined programmatically, not here.)  */
/*-****************************************************************************/

"LDraw: 0" = "Black";
"LDraw: 1" = "Blue";
"LDraw: 2" = "Green";
"LDraw: 3" = "Teal";
"LDraw: 4" = "Red";
"LDraw: 5" = "Dark Pink";
"LDraw: 6" = "Brown";
"LDraw: 7" = "Gray";
"LDraw: 8" = "Dark Gray";
"LDraw: 9" = "Light Blue";
"LDraw: 10" = "Bright Green";
"LDraw: 11" = "Turquiose (Cyan)";
"LDraw: 12" = "Light Red (Scala, Salmon)";
"LDraw: 13" = "Pink";
"LDraw: 14" = "Yellow";
"LDraw: 15" = "White";
"LDraw: 16" = "(Current Color)";
"LDraw: 17" = "Light Green (Belville, Pastel Green)";
"LDraw: 18" = "Light Yellow (Belville)";
"LDraw: 19" = "Tan";
"LDraw: 20" = "Light Violet (Belville)";
"LDraw: 21" = "Phosphor White (Glow in the Dark)";
"LDraw: 22" = "Violet (Purple)";
"LDraw: 23" = "Violet Blue";
"LDraw: 24" = "(Edge Color)";
"LDraw: 25" = "Orange";
"LDraw: 26" = "Magenta";
"LDraw: 27" = "Lime";
"LDraw: 28" = "Dark Tan";
"LDraw: 33" = "Trans Blue (or trans dark blue)";
"LDraw: 34" = "Trans Green";
"LDraw: 36" = "Trans Red";
"LDraw: 37" = "Trans Violet";
"LDraw: 40" = "Trans Gray (Smoke)";
"LDraw: 41" = "Trans Light Cyan (Trans Light Blue)";
"LDraw: 42" = "Trans Flu Lime (Trans Neon Green, Trans Yellow-Green)";
"LDraw: 45" = "Trans Pink";
"LDraw: 46" = "Trans Yellow";
"LDraw: 47" = "Clear (trans white)";
"LDraw: 57" = "Trans Flu Orange";
"LDraw: 70" = "Reddish Brown";
"LDraw: 71" = "Stone Gray (New Gray)";
"LDraw: 72" = "Dark Stone Gray (New Dark Gray)";
"LDraw: 134" = "Pearl Copper";
"LDraw: 135" = "Pearl Gray";
"LDraw: 137" = "Pearl Sand Blue";
"LDraw: 142" = "Pearl Gold";
"LDraw: 256" = "Rubber Black";
"LDraw: 272" = "Dark Blue";
"LDraw: 273" = "Rubber Blue";
"LDraw: 288" = "Dark Green";
"LDraw: 320" = "Dark Red";
"LDraw: 324" = "Rubber Red";
"LDraw: 334" = "Chrome Gold";
"LDraw: 335" = "Sand Red";
"LDraw: 366" = "Earth Orange";
"LDraw: 373" = "Sand Violet";
"LDraw: 375" = "Rubber Gray";
"LDraw: 378" = "Sand Green";
"LDraw: 379" = "Sand Blue";
"LDraw: 383" = "Chrome Silver";
"LDraw: 462" = "Light Orange";
"LDraw: 484" = "Dark Orange";
"LDraw: 494" = "Electric Contact";
"LDraw: 503" = "Light Gray";
"LDraw: 511" = "Rubber White";